[
  {
    "conference": "Kansas City Developer Conference",
    "title": "Defense Against the JavaScript Dark Arts",
    "slug": "/talks/kcdc-js-2019",
    "description": "In the magical world of JavaScript, you have the power to do almost anything, but with great power comes great responsibility. Do you have the magical prowess to protect yourself from the darkest depths of JavaScript? \n In this talk, we discuss 5 spells that you can use protect yourself from the most common JavaScript pitfalls. Some of these are as easy as a swish and flick of the old magic wand thanks to modern JavaScript tooling, but the rest comes from establishing best practices and a new mindset. After this talk, you will walk away head high and wand at the ready!",
    "date": "7/19/2019",
    "imageUrl": "someURL",
    "id": "1",
    "slidesLink": "https://slides.com/jamesquick/defense-against-the-javascript-dark-arts"
  },
  {
    "conference": "Kansas City Developer Conference",
    "title": "CI/CD - It's a Culture Shift",
    "slug": "/talks/kcdc-cicd-2019",
    "description": "With all the advancements in the tooling around CI and CD, implementing the technology has never been easier. Helping your team embrace the cultural change necessary to follow this cycle… that’s another story. In this talk, you’ll learn the true meaning of CI/CD — that’s Continuous Integration and Continuous Deployment, if you don’t speak alphabet soup — and the various principles that drive it. To embrace these principles, you’ll need to change your team’s mindset, which can be a tough transition. I lead this transition in my organization, and I will walk you through the lessons I learned. After this talk, you will have a clear understanding of CI/CD as well as how to implement a true cultural shift in your team to take full advantage of this new, powerful methodology.",
    "date": "7/19/2019",
    "imageUrl": "someURL",
    "id": "2",
    "slidesLink": "https://1drv.ms/p/s!Al5KhgUe-N3amLhuh0BNjECEYSh1FQ?e=k62rhK"
  },
  {
    "conference": "THAT Conference",
    "title": "Microservices - The Good, the Bad, and the Ugly",
    "slug": "/talks/that-conference-2019",
    "description": "Microservices is the hot new architecture, but like any other technology, it's not perfect. Too often, we embrace technologies without exploring or considering the potential downsides. In this talk, you will hear an unbiased and language agnostic discussion around Microservices, the good, the bad, and the ugly. Along the way, I will share what I’ve learned over the past year from going from zero to production. After this talk, you will have a better understanding of what to consider when looking at adopting a Microservices architecture.",
    "date": "8/6/2019",
    "imageUrl": "someURL",
    "id": "3",
    "slidesLink": "https://1drv.ms/p/s!Al5KhgUe-N3amLh8M67xkX3KdhnDqQ?e=aS2ZWF"
  }
]
